app/helpers/locations_helper.rb

SELECT `locations`.* FROM `locations`
---
	def locToJson
		@locations = Location.all.as_json.to_json