app/helpers/timetracks_helper.rb

SELECT `timetracks`.* FROM `timetracks`
---
	def ttToJson
		@timetracks = Timetrack.all.as_json.to_json