app/controllers/locations_controller.rb

  def index

    if  params[:search].present?
      @search = params[:search]
      @locations = Location.where('id LIKE ? OR user_id LIKE ?', "%#{@search}%", "%#{@search}%")
      #@locations = Location.joins(:user).where("users.name = ?","%#{@search}%")
      #@locations = Location.joins(:user).where("users.name = ? ","%#{@search}%")
    else
       @locations = Location.all
---
SELECT `locations`.* FROM `locations` WHERE (id LIKE '%1%' OR user_id LIKE '%1%')
SELECT `locations`.* FROM `locations`

  def create
    @location = Location.new(location_params)

    respond_to do |format|
      if @location.save
---
INSERT INTO `locations` (`desc`, `meters`, `longitude`, `latitude`, `user_id`, `created_at`, `updated_at`) VALUES ('Curitiba', 900, -46.35435, -23.944394, 1, '2019-04-01 04:05:22', '2019-04-01 04:05:22')

    def set_location
      @location = Location.find(params[:id])
---
SELECT  `locations`.* FROM `locations` WHERE `locations`.`id` = 1 LIMIT 1