app/controllers/timetracks_controller.rb

SELECT `timetracks`.* FROM `timetracks` WHERE `timetracks`.`id` IN (NULL, NULL)
SELECT `timetracks`.* FROM `timetracks`
---
  def index

    if  params[:search].present?
      @search = params[:search]
      @timetracks = Timetrack.where("id LIKE CAST (:search AS INTEGER) OR user_id LIKE CAST (:search AS INTEGER)", search: "%#{@search}%")

    else
       @timetracks = Timetrack.all

INSERT INTO `timetracks` (`longitude`, `latitude`, `user_id`, `comment`, `created_at`, `updated_at`) VALUES (-46.371289, -23.941365, 1, '', '2019-04-01 00:35:13', '2019-04-01 00:35:13')
---
  def create
    @timetrack = Timetrack.new(timetrack_params)

    respond_to do |format|
      if @timetrack.save

SELECT  `timetracks`.* FROM `timetracks` WHERE `timetracks`.`id` = 2 LIMIT 1
---
    def set_timetrack
      @timetrack = Timetrack.find(params[:id])