app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save
---
INSERT INTO `users` (`name`, `email`, `user_role`, `username`, `password_digest`, `created_at`, `updated_at`) VALUES ('hue', 'uqewihuiqew@gmail.com', 1, 'hueheuehu', 'hehuhuewuhew', '2019-03-28 22:17:30', '2019-03-28 22:17:30')

    def set_user
      @user = User.find(current_user.id)
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1